[
  {
    "id": "esc1",
    "titulo": "Preparing for the School Year",
    "narrativa": "You are preparing to begin the school year as a teacher of {materia} en {nivel_educativo}. How do you plan your first lessons?",
    "opciones": {
      "a": {
        "texto": "You create a detailed plan based on the context and group needs.",
        "consecuencia": "You have clarity about your goals from day one.",
        "retroalimentacion": "Good planning is the foundation of successful teaching.",
        "impacto": "Improves group connection and pedagogical mastery."
      },
      "b": {
        "texto": "You reuse your old materials without adapting them.",
        "consecuencia": "Some activities don't work well with this group.",
        "retroalimentacion": "Adapting your planning to the context is essential.",
        "impacto": "Class environment is average."
      },
      "c": {
        "texto": "You wait to get to know the group before planning in depth.",
        "consecuencia": "You feel unsure during your first lessons.",
        "retroalimentacion": "Knowing your group is key, but a flexible base helps.",
        "impacto": "Increases workload and stress."
      }
    }
  },
  {
    "id": "esc2",
    "titulo": "First Day of Class",
    "narrativa": "You are about to start teaching {materia} en {nivel_educativo}. Tendrás un grupo de {numero_alumnos} estudiantes. How do you prepare your first class?",
    "opciones": {
      "a": {
        "texto": "You design a very theoretical session to show your knowledge.",
        "consecuencia": "The group feels overwhelmed and participates little.",
        "retroalimentacion": "It's important to connect with the group before diving into content. Showing empathy builds trust.",
        "impacto": "No change"
      },
      "b": {
        "texto": "You prepare interactive activities to connect with the group.",
        "consecuencia": "A trusting atmosphere is created from day one.",
        "retroalimentacion": "Building rapport from day one improves class climate and willingness to learn.",
        "impacto": "Improves class environment"
      },
      "c": {
        "texto": "You use a generic PowerPoint presentation and a summary.",
        "consecuencia": "The session goes smoothly but lacks genuine connection.",
        "retroalimentacion": "Personalizing the welcome can make a big difference.",
        "impacto": "Neutral group relationship"
      }
    }
  }
]