[
  {
    "id": "esc1",
    "titulo": "Preparación para el ciclo",
    "narrativa": "Estás a punto de iniciar el ciclo escolar como profesor(a) de {materia} en {nivel_educativo}. ¿Cómo planeas tus primeras clases?",
    "opciones": {
      "a": {
        "texto": "Elaboras un plan detallado con base en el contexto y necesidades del grupo.",
        "consecuencia": "Tienes claridad sobre tus objetivos desde el primer día.",
        "retroalimentacion": "Una buena planeación es la base del éxito docente.",
        "impacto": "Mejora la relación con el grupo y el dominio pedagógico."
      },
      "b": {
        "texto": "Reutilizas tus materiales del año pasado sin adaptarlos.",
        "consecuencia": "Algunas actividades no funcionan bien con este grupo.",
        "retroalimentacion": "Adaptar tu planificación al contexto es esencial.",
        "impacto": "El ambiente de clase es regular."
      },
      "c": {
        "texto": "Esperas a conocer al grupo antes de planear a fondo.",
        "consecuencia": "Te sientes inseguro(a) en tus primeras clases.",
        "retroalimentacion": "Conocer al grupo es clave, pero una base flexible ayuda.",
        "impacto": "Aumenta la carga de trabajo y el estrés."
      }
    }
  },
  {
    "id": "esc2",
    "titulo": "Primer día de clases",
    "narrativa": "Estás por iniciar clases como profesor(a) de {materia} en {nivel_educativo}. Tendrás un grupo de {numero_alumnos} estudiantes. ¿Cómo preparas tu clase inicial?",
    "opciones": {
      "a": {
        "texto": "Diseñas una sesión muy teórica para mostrar que dominas el contenido.",
        "consecuencia": "El grupo se siente abrumado y participa poco.",
        "retroalimentacion": "Es importante conectar con el grupo antes de profundizar en los contenidos. Mostrar empatía genera confianza.",
        "impacto": "Sin cambios"
      },
      "b": {
        "texto": "Preparas actividades para conocer al grupo y que ellos te conozcan.",
        "consecuencia": "Se genera un ambiente de confianza desde el inicio.",
        "retroalimentacion": "Construir rapport desde el inicio mejora el ambiente y la disposición a aprender.",
        "impacto": "Mejora el ambiente de clase"
      },
      "c": {
        "texto": "Usas un plan genérico con una presentación en PowerPoint y un resumen.",
        "consecuencia": "La sesión transcurre sin problemas pero sin conexión real.",
        "retroalimentacion": "Personalizar la bienvenida puede marcar una gran diferencia.",
        "impacto": "Relación neutral con el grupo"
      }
    }
  }
]